In [2]:
!rm ../Resources/sampleData.sqlite

In [3]:
import pandas as pd

In [4]:
df = pd.read_csv("../Resources/sampleData.csv")

In [5]:
df.head()

   id first_name   last_name       Phone Number      Time zone
0   1      Peter  Richardson    7-(789)867-9023  Europe/Moscow
1   2     Janice       Berry   86-(614)973-1727    Asia/Harbin
2   3     Andrea      Hudson   86-(918)527-6371  Asia/Shanghai
3   4     Arthur    Mcdonald  420-(553)779-7783  Europe/Prague
4   5      Kathy     Morales  351-(720)541-2124  Europe/Lisbon

In [6]:
# Import SQLAlchemy `automap` and other dependencies
from sqlalchemy import create_engine, inspect

In [7]:
# Create the connection engine
engine = create_engine("sqlite:///../Resources/sampleData.sqlite")
conn = engine.connect()

In [ ]:
df.to_sql("users", conn, index=False)

In [ ]:
help(df.to_sql)

In [ ]:
import pymysql
pymysql.install_as_MySQLdb()

engine = create_engine("mysql://jesijyq410t674fw:b9zkyf3tqtnqpxu0@alv4v3hlsipxnujn.cbetxkdyhwsb.us-east-1.rds.amazonaws.com:3306/igcommwvlv38ehnk")
conn = engine.connect()

In [ ]:
df.to_sql("users", conn, index=False,if_exists="replace")

# Specifying the dtype

In [ ]:
from sqlalchemy import Column, Integer, String, Float

In [ ]:
dtype_map = {'id': Integer, 
             'first_name': String(255), 
             'last_name': String(255), 
             'Phone Number': String(20), 
             'Time zone': String(255)}

df.to_sql("users", conn, dtype=dtype_map, index=False, if_exists='replace')